In [1]:
# 라이브러리 가져오기
import pandas as pd # Series, DataFrame 사용
import numpy as np # 값을 생성하는데 사용

### 계층 색인

- 행, 열의 각 축에 대해 다중 단계(계층)를 지정하여 데이터 차원을 설정
- 인덱스에 다차원 리스트를 전달하면 계층 색인을 지정할 수 있음
- 데이터 구조를 재배열하거나 pivot 테이블과 같은 그룹 기반 작업에 유용
- 재배열 메서드
    - stack() : 컬럼을 로우로 피벗
    - unstack() : 로우를 컬럼으로 피벗

In [2]:
# Series
# 인덱스에 다차원 리스트(아이템 2개)를 전달
# 다차원리스트[0] 상위계층
# 상위계층 작성시 주의점 : 각 계층별로 속하는 하위계층 값의 개수만큼 계층명 작성
# 상위계층 리스트 개수 = 하위계층 리스트 개수
# 다차원리스트[1] : 하위계층
# 실습 --->
# 로우 인덱스 - 상위계층 : a, b, c, d
# 하위계층 : a(1, 2, 3), b(1, 2), c(1, 2, 3, 4), d(1)
s1 = pd.Series(np.arange(10), index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'c', 'c', 'd'],
                                    [1, 2, 3, 1, 2, 1, 2, 3, 4, 1]])
s1

a  1    0
   2    1
   3    2
b  1    3
   2    4
c  1    5
   2    6
   3    7
   4    8
d  1    9
dtype: int32

In [3]:
s1.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2),
            ('c', 3),
            ('c', 4),
            ('d', 1)],
           )

In [4]:
# 상위계층에 접근
# 계층 색인이 적용된 객체에 상위 인덱스에 접근 : 일반적인 Series 인덱싱으로 접근
s1['c']

1    5
2    6
3    7
4    8
dtype: int32

In [5]:
# 계층색인에 대한 슬라이싱 : 마지막 인덱스도 포함 ('b' : 'd'로 입력시 b, c, d로 조회)
s1['b':'d']

b  1    3
   2    4
c  1    5
   2    6
   3    7
   4    8
d  1    9
dtype: int32

In [6]:
# 하위계층에 접근
# a, b, c, d에서 하위계층 라벨번호 2인 데이터만 조회
# 데이터 [상위계층명, 하위계층명]
s1[:, 2]

a    1
b    4
c    6
dtype: int32

In [7]:
# 하위 계층에 슬라이싱 : loc메서드를 이용해서 슬라이싱
# 하위계층이 c이고 하위계층을 2~4까지 슬라이싱(.loc는 마지막 번호도 포함)
s1['c'].loc[2:4]

2    6
3    7
4    8
dtype: int32

In [8]:
# unstack() : 최하위(기본동작) 에 있는 로우 계층을 컬럼으로 적용하여 위로 올림
# Series 객체를 DataFrame화 할 수 있음
# NaN : 기존에 없던 로우 계층에 대한 값
s1.unstack()

     1    2    3    4
a  0.0  1.0  2.0  NaN
b  3.0  4.0  NaN  NaN
c  5.0  6.0  7.0  8.0
d  9.0  NaN  NaN  NaN

In [9]:
# stack() 메서드 : 컬럼에 있던 값을 가장 하위 인덱스로 내려서 재배열
# DataFrame을 다시 Series화 할 때 사용
s1.unstack().stack()

a  1    0.0
   2    1.0
   3    2.0
b  1    3.0
   2    4.0
c  1    5.0
   2    6.0
   3    7.0
   4    8.0
d  1    9.0
dtype: float64

In [10]:
# DataFrame 생성
# 구조 : 4 * 5
# 로우 인덱스 : 상위(2017, 2018) / 하위(모든 상위 인덱스에 대해 동일하게 a, b)
# 컬럼 인덱스 : 상위(서울, 경기) / 하위(서울-강남, 잠실 / 경기-안양, 수원, 판교)
# 값 : 1씩 증가하는 20개
df = pd.DataFrame(np.arange(20).reshape(4,5),
                 index=[[2017, 2017, 2018, 2018],
                       ['a', 'b', 'a', 'b']], 
                  columns=[['서울', '서울', '경기', '경기', '경기'],
                           ['강남', '잠실','안양', '수원', '판교']])
df

        서울      경기
        강남  잠실  안양  수원  판교
2017 a   0   1   2   3   4
     b   5   6   7   8   9
2018 a  10  11  12  13  14
     b  15  16  17  18  19

In [11]:
# 컬럼의 상위 계층 접근 : 일반적인 df컬럼 인덱싱 방식
# '서울' 데이터 조회
df['서울']

        강남  잠실
2017 a   0   1
     b   5   6
2018 a  10  11
     b  15  16

In [12]:
# 컬럼이 이중으로 구조가 만들어져 있으므로 인덱싱도 이중으로 해야 하나의 조회할 수 있음
df['서울']['강남']

2017  a     0
      b     5
2018  a    10
      b    15
Name: 강남, dtype: int32

In [13]:
# 튜플로 전달시 하나의 리스트로 2개 이상의 계층 처리 가능
df[('서울','강남')]

2017  a     0
      b     5
2018  a    10
      b    15
Name: (서울, 강남), dtype: int32

In [14]:
# row의 상위 계층 접근
# 2017년 데이터를 조회해주세요.
df.loc[2017]

  서울    경기
  강남 잠실 안양 수원 판교
a  0  1  2  3  4
b  5  6  7  8  9

In [15]:
# 2017년도 전반기(a) 데이터 조회
df.loc[2017].loc['a']

서울  강남    0
    잠실    1
경기  안양    2
    수원    3
    판교    4
Name: a, dtype: int32

In [16]:
df.loc[(2017, 'a')]

서울  강남    0
    잠실    1
경기  안양    2
    수원    3
    판교    4
Name: (2017, a), dtype: int32

In [17]:
# 안양 ~ 수원까지 데이터 조회
# 주의점 : 데이터프레임 컬럼은 row 슬라이싱 결과에 대해서만 슬라이싱 적용 가능
# df['경기']['안양':'수원'] -> error
df['경기'].loc[:, "안양":"수원"]

        안양  수원
2017 a   2   3
     b   7   8
2018 a  12  13
     b  17  18

In [18]:
# row의 최하위계층(a, b)를 컬럼으로 올리기 : unstack()
df.unstack()

      서울              경기
      강남      잠실      안양      수원      판교
       a   b   a   b   a   b   a   b   a   b
2017   0   5   1   6   2   7   3   8   4   9
2018  10  15  11  16  12  17  13  18  14  19

In [19]:
# 컬럼 최하위계층을 로우의 하위계층으로 재배열 : stack()
df.stack()

             경기    서울
2017 a 강남   NaN   0.0
       수원   3.0   NaN
       안양   2.0   NaN
       잠실   NaN   1.0
       판교   4.0   NaN
     b 강남   NaN   5.0
       수원   8.0   NaN
       안양   7.0   NaN
       잠실   NaN   6.0
       판교   9.0   NaN
2018 a 강남   NaN  10.0
       수원  13.0   NaN
       안양  12.0   NaN
       잠실   NaN  11.0
       판교  14.0   NaN
     b 강남   NaN  15.0
       수원  18.0   NaN
       안양  17.0   NaN
       잠실   NaN  16.0
       판교  19.0   NaN

In [20]:
# 계층의 인덱스번호 또는 라벨을 사용하여 상, 하위간 교화
# swaplevel(key1, key2, axis=0(기본값))
# axis가 0인 경우는 row의 상하위 개념이 뒤집힌다
df.swaplevel(1, 0)

        서울      경기
        강남  잠실  안양  수원  판교
a 2017   0   1   2   3   4
b 2017   5   6   7   8   9
a 2018  10  11  12  13  14
b 2018  15  16  17  18  19

In [21]:
# swaplevel에 axis=1을 주면 계층이 아닌 컬럼에 변동이 생깁니다.
df.swaplevel(1, 0, axis=1)

        강남  잠실  안양  수원  판교
        서울  서울  경기  경기  경기
2017 a   0   1   2   3   4
     b   5   6   7   8   9
2018 a  10  11  12  13  14
     b  15  16  17  18  19

### 객체 복사

- 할당기호(=) / 슬라이싱 : 원본과 상호 종속적인 복사본 객체 생성(얕은복사)
- obj.copy() : 원본과 독립적인 복사본 객체 생성(깊은복사)

In [22]:
# 모든 값이 1인 5 * 1 구조의 Series 생성
s1 = pd.Series(np.ones(5))
s1

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
dtype: float64

In [23]:
# 할당기호 = 로 복사 : 얕은복사
s2 = s1

In [24]:
# 할당기호로 복사한 객체의 아이템 수정
s2[0] = 10
s2

0    10.0
1     1.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [25]:
s1

0    10.0
1     1.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [26]:
# = 을 이용한 대입은 원본객체도 변경됨
s1

0    10.0
1     1.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [27]:
# 원본객체의 아이템 수정
s1[1] = 3
s1

0    10.0
1     3.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [28]:
s2

0    10.0
1     3.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [29]:
# 슬라이싱으로 복사(일반 파이썬 -> 깊은복사, pandas -> 얕은복사로 취급됨)
s3 = s1[:]
s3

0    10.0
1     3.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [30]:
# 복사본 객체 아이템 수정
s3[2] = -9
s3

0    10.0
1     3.0
2    -9.0
3     1.0
4     1.0
dtype: float64

In [31]:
# s1과 s2 확인
print(s1)
print('------')
print(s2)

0    10.0
1     3.0
2    -9.0
3     1.0
4     1.0
dtype: float64
------
0    10.0
1     3.0
2    -9.0
3     1.0
4     1.0
dtype: float64

In [32]:
# 원본 변경
s1[3] = 33
s1

0    10.0
1     3.0
2    -9.0
3    33.0
4     1.0
dtype: float64

In [33]:
# 복사본 객체로 적용받음
print(s2)
print(s3)

0    10.0
1     3.0
2    -9.0
3    33.0
4     1.0
dtype: float64
0    10.0
1     3.0
2    -9.0
3    33.0
4     1.0
dtype: float64

In [34]:
# .copy()를 이용한 깊은복사(복사)
s4 = s1.copy()

In [35]:
# s4 수정(s1 영향 X)
s4[4] = 44
s4

0    10.0
1     3.0
2    -9.0
3    33.0
4    44.0
dtype: float64

In [36]:
s1

0    10.0
1     3.0
2    -9.0
3    33.0
4     1.0
dtype: float64

In [37]:
# s1을 변경하는 경우에도 4는 영향받지않음
s1[0] = 0
s1

0     0.0
1     3.0
2    -9.0
3    33.0
4     1.0
dtype: float64

In [38]:
s4

0    10.0
1     3.0
2    -9.0
3    33.0
4    44.0
dtype: float64

### 정렬

- obj.sort_index() : 인덱스를 기준으로 정렬 (기본값은 ascending=True, 오름차순 정렬)
    - DataFrame, Series
        - axis = 0 : 기본값, 로우 인덱스 기준으로 정렬
        - axis = 1 : 컬럼 인덱스 기준으로 정렬
- obj.sort_values() : 값을 기준으로 정렬
    - DataFrame, Series
        - by : 정렬의 기준이 되는 인덱스 값 전달
        - axis = 0 : 기본값, 컬럼을 기준으로 로우 인덱스를 정렬하며 기준값으로 by에 인덱스 컬럼 레벨 또는 컬럼명 전달
        - axis = 1 : 로우 인덱스를 기준으로 컬럼 라벨을 정렬하며 기준값으로 by에 레벨 또는 라벨명 전달

In [39]:
# Series생성
# 값과 인덱스라벨이 순서대로 들어가지않은 Series
s1 = pd.Series([2, 3, 1, 7, 0], index=list('gacfd'))
s1

g    2
a    3
c    1
f    7
d    0
dtype: int64

In [40]:
# 인덱스 기준 오름차순으로 정렬
# 기본동작 : 오름차순 & 로우 인덱스
s1.sort_index()

a    3
c    1
d    0
f    7
g    2
dtype: int64

In [41]:
# 인덱스 기준 내림차순으로 정렬
s1.sort_index(ascending=False)

g    2
f    7
d    0
c    1
a    3
dtype: int64

In [42]:
# 일시적 변경이므로 s1에는 영향을 주지 않음
s1

g    2
a    3
c    1
f    7
d    0
dtype: int64

In [43]:
# 값 기준 오름차순으로 정렬
s1.sort_values()

d    0
c    1
g    2
a    3
f    7
dtype: int64

In [44]:
# 값 기준 내림차순으로 정렬
s1.sort_values(ascending=False)

f    7
a    3
g    2
c    1
d    0
dtype: int64

In [45]:
# 원본에 바로 반영되지 않음
s1

g    2
a    3
c    1
f    7
d    0
dtype: int64

In [46]:
# DataFrame 생성
# 4 * 5 무작위정수(np.random.randint())
# 로우/컬럼 인덱스도 순서가 없는 값 지정
# 로우 'hcae', 컬럼은 'EAFCD'
df1 = pd.DataFrame(np.random.randint(20, size=(4,5)), index=list('hcae'), columns=list('EAFCD'))
df1

    E   A   F   C   D
h  19  16  17  11  11
c   3  14   6   9   6
a   6  18  13  12  16
e  16   6   5   7  10

In [47]:
# 로우 인덱스 기준으로 오름차순 정렬 (axis=0)
df1.sort_index()

    E   A   F   C   D
a   6  18  13  12  16
c   3  14   6   9   6
e  16   6   5   7  10
h  19  16  17  11  11

In [48]:
# 로우 인덱스 기준으로 내림차순 정렬
df1.sort_index(ascending=False)

    E   A   F   C   D
h  19  16  17  11  11
e  16   6   5   7  10
c   3  14   6   9   6
a   6  18  13  12  16

In [49]:
# 컬럼명 기준으로 오름차순 정렬(axis=1)
df1.sort_index(axis=1)

    A   C   D   E   F
h  16  11  11  19  17
c  14   9   6   3   6
a  18  12  16   6  13
e   6   7  10  16   5

In [50]:
# 컬럼명 기준으로 내림차순 정렬
df1.sort_index(axis=1, ascending=False)

    F   E   D   C   A
h  17  19  11  11  16
c   6   3   6   9  14
a  13   6  16  12  18
e   5  16  10   7   6

In [51]:
# 컬럼 기준 내림차순 정렬 후, 로우 기준으로 오름차순 정렬
df1.sort_index(axis=1, ascending=False).sort_index(axis=0)

    F   E   D   C   A
a  13   6  16  12  18
c   6   3   6   9  14
e   5  16  10   7   6
h  17  19  11  11  16

In [52]:
# 원본에는 변경 없음
df1

    E   A   F   C   D
h  19  16  17  11  11
c   3  14   6   9   6
a   6  18  13  12  16
e  16   6   5   7  10

In [53]:
# 값 기준으로 정렬
# 컬럼 D의 값을 기준으로 오름차순 정렬
# sort_values(axis=0, by='기준컬럼명') : 기본동작(정렬결과를 로우에 반영)
df1.sort_values(by='D')

    E   A   F   C   D
c   3  14   6   9   6
e  16   6   5   7  10
h  19  16  17  11  11
a   6  18  13  12  16

In [54]:
# 컬럼 A를 기준으로 내림차순 정렬
df1.sort_values(ascending=False, by='A')

    E   A   F   C   D
a   6  18  13  12  16
h  19  16  17  11  11
c   3  14   6   9   6
e  16   6   5   7  10

In [55]:
# 인덱스라벨(row) c의 값을 오름차순으로 정렬
# 결과적으로 정렬되는 대상 : 컬럼
# 정렬의 기준 : row 라벨
df1.sort_values(axis=1, by='c')

    E   F   D   C   A
h  19  17  11  11  16
c   3   6   6   9  14
a   6  13  16  12  18
e  16   5  10   7   6

In [57]:
# 로우 'e'를 기준으로 값을 내림차순으로 정렬
df1.sort_values(axis=1, by='e', ascending=False)

    E   D   C   A   F
h  19  11  11  16  17
c   3   6   9  14   6
a   6  16  12  18  13
e  16  10   7   6   5

In [63]:
# 두 개의 컬럼에 대해서 정렬 : 리스트로 묶어서 by의 인자값으로 전달
# 정렬 우선순위 : 차례대로 1순위 > 2순위(1순위 동점시 2순위로 넘어감)
# 1순위 정렬 후 1순위 컬럼의 동점값에 대해 2순위 컬럼의 값이 재정렬
# 동일한 값이 아니라면 무조건 1순위 컬럼이 우선
df1.sort_values(by=['D','A'])

    E   A   F   C   D
c   3  14   6   9   6
e  16   6   5   7  10
h  19  16  17  11  11
a   6  18  13  12  16

In [64]:
# D는 오름차순 A는 내림차순으로 하고 싶다면
# ascending = [True, False] 와 같이 각각의 컬럼에 대해서 ascending을 따로 매겨준다
df1.sort_values(by=['D','A'], ascending=[True, False])

    E   A   F   C   D
c   3  14   6   9   6
e  16   6   5   7  10
h  19  16  17  11  11
a   6  18  13  12  16

### 연습문제

#### 1. 아래의 데이터프레임을 생성하세요

- 학생들의 점수는 50 이상 100미만의 무작위 정수 값을 생성하여 사용

<img src="img/df_sort_practice1.png" width=250 align='left'>

In [131]:
# 데이터프레임 생성

# pd.DataFrame(np.random.randint(50, 100, 20).reshape(5, 4), 
#             index=['Kim', 'Park', 'Lee', 'Jung', 'Moon'],
#            columns=[[2016, 2016, 2017, 2017],['영어', '수학', '영어', '수학']])

df = pd.DataFrame(np.random.randint(50,101, size=(5,4)),
                 index=[['Kim', 'Park', 'Lee', 'Jung', 'Moon']],
                  columns=[[2016, 2016, 2017, 2017],['영어', '수학', '영어', '수학']])
df

     2016     2017
       영어  수학   영어  수학
Kim    66  94   91  62
Park   59  97   89  50
Lee    77  69   72  64
Jung   63  99   67  85
Moon   66  52   59  75

In [132]:
# 컬럼 인덱스 이름 설정(리스트로 넘김)
# 멀티 인덱스는 무조건 set_names를 이용해야 입력가능
# df.columns.name=['연도', '과목명']
df.columns.set_names(['연도', '과목명'], inplace = True)

In [133]:
df

연도   2016     2017
과목명    영어  수학   영어  수학
Kim    66  94   91  62
Park   59  97   89  50
Lee    77  69   72  64
Jung   63  99   67  85
Moon   66  52   59  75

In [134]:
# 로우 인덱스 이름 설정
df.columns.name = '학생명'
df

연도   2016     2017
과목명    영어  수학   영어  수학
Kim    66  94   91  62
Park   59  97   89  50
Lee    77  69   72  64
Jung   63  99   67  85
Moon   66  52   59  75

#### 2. 2016년 데이터만 별도의 데이터프레임으로 분리 저장하세요.(깊은복사)

In [135]:
df2016 = df[2016].copy()
df2016

과목명   영어  수학
Kim   66  94
Park  59  97
Lee   77  69
Jung  63  99
Moon  66  52

#### 3. 2016년 데이터에 대해 학생 이름을 기준으로 오름차순 정렬하세요.

In [136]:
df2016.sort_index(axis=0)

과목명   영어  수학
Jung  63  99
Kim   66  94
Lee   77  69
Moon  66  52
Park  59  97

####  4. 2016년 데이터의 과목별 점수에 대하여 영어 점수가 높은 순서로 정렬하고, 영어 점수 동점자의 경우 수학 점수가 낮은 순서로 정렬하세요.

In [137]:
df2016.sort_values(by=['영어', '수학'], ascending=[False, True])

과목명   영어  수학
Lee   77  69
Moon  66  52
Kim   66  94
Jung  63  99
Park  59  97

### 데이터 합치기

- merge
    - pandas 객체의 메서드로 pandas.merge(df1, df2 ...)로 사용
    - 두 개의 데이터프레임에 대해 특정 컬럼을 기준으로 합치기
    - 주요 파라미터
        - how : 합치는 방식으로 inner(기본값), left, right, outer 방식 존재
        - on : 합치는 기준으로 두 개의 데이터프레임에 공통으로 존재하는 컬럼명을 사용해야함(기본값=None)

In [141]:
# 고객번호와 고객명을 저장하고 있는 데이터프레임 생성
# 딕셔너리 타입으로 데이터프레임 데이터 생성 : key:col, value -> list() : row
df1 = pd.DataFrame({'no':[30, 31, 32, 33, 34],
        'name':['김파이썬', '이장고', '빅팬더스', '강넘파이', '최주피터']})
df1

   no  name
0  30  김파이썬
1  31   이장고
2  32  빅팬더스
3  33  강넘파이
4  34  최주피터

In [142]:
# 고객 번호와 주문수량을 저장하고 있는 데이터프레임 생성
# 다른 고객번호(no)를 일부 지정
df2 = pd.DataFrame({'no':[30, 33, 40, 41], 'amount':[100, 130, 40, 60]})
df2

   no  amount
0  30     100
1  33     130
2  40      40
3  41      60

In [143]:
# 가장 기본적인 merge 방식 : 공통 걸럼을 기준으로 두 df에 모두 존재하는 교집합만 추출
# 기본 동작 : how = 'inner'
# df1 & df2의 공통컬럼 : no
# 공통 컬럼 내부의 공통 값 : 30, 33
# df1 : 30 ~ 34
# df2 : 30, 33, 40, 41
pd.merge(df1, df2)

   no  name  amount
0  30  김파이썬     100
1  33  강넘파이     130

In [144]:
# how = 'outer' : 결합 기준으로 공통 컬럼을 사용함
# 교집합이 아닌 부분에 대해서는 NaN으로 처리(누락되는 데이터 없음)
# 합집합 형태로 만들어줌
pd.merge(df1, df2, how='outer')

   no  name  amount
0  30  김파이썬   100.0
1  31   이장고     NaN
2  32  빅팬더스     NaN
3  33  강넘파이   130.0
4  34  최주피터     NaN
5  40   NaN    40.0
6  41   NaN    60.0

In [145]:
# left : 첫 번째로 전다한 df1의 데이터는 모두 살리고, df2에서는 df1과 겹칠때만 남김
pd.merge(df1, df2, how='left')

   no  name  amount
0  30  김파이썬   100.0
1  31   이장고     NaN
2  32  빅팬더스     NaN
3  33  강넘파이   130.0
4  34  최주피터     NaN

In [146]:
# right : 두 번째 데이터프레임의 데이터를 보존
# df1에서는 df2와 겹치는 경우에 한해 데이터를 남김
pd.merge(df1, df2, how='right')

   no  name  amount
0  30  김파이썬     100
1  33  강넘파이     130
2  40   NaN      40
3  41   NaN      60

In [147]:
# 공통 컬럼이 두 개 이상인 경우
# '고객명', '날짜', '정보' 컬럼 3개에 데이터를 저장하고 있는 데이터 프레임 생성
df3 = pd.DataFrame({'고객명':['김파이썬', '이장고', '박팬더스'], '날짜':['2020-06-01', '2020-06-10', '2020-06-14'],
                   '정보':['010', '011', '019']})
df3

    고객명          날짜   정보
0  김파이썬  2020-06-01  010
1   이장고  2020-06-10  011
2  박팬더스  2020-06-14  019

In [148]:
# 고객명, 정보를 저장하고 있는 데이터프레임 생성
df4 = pd.DataFrame({'고객명':['김파이썬', '박팬더스', '최넘파이'], '정보':['F', 'M', 'M']})
df4

    고객명 정보
0  김파이썬  F
1  박팬더스  M
2  최넘파이  M

In [149]:
# 공통된 이름을 가진 컬럼이 2개 이상인 경우, 파라미터가 없으면 결과도 없다
pd.merge(df3, df4)

Empty DataFrame
Columns: [고객명, 날짜, 정보]
Index: []

In [150]:
# on 파라미터 : 공통된 컬럼이 여럿인 경우 결합 기준 컬럼을 지정
# 합칠때 key로 사용할 컬럼 : '고객명'
# 공통컬럼 결과 : 고객명, 정보 -> 정보 컬럼 결과를 확인
# 기본동작으로 merge : inner
pd.merge(df3, df4, on='고객명')

    고객명          날짜 정보_x 정보_y
0  김파이썬  2020-06-01  010    F
1  박팬더스  2020-06-14  019    M

In [153]:
# left_on, right_on : 두 개의 데이터프레임에 대해서 서로 다른 기준 컬럼을 저장
# 예) 동일한 속성의 자료를 저장하는 컬럼인데 이름이 다른 경우
# 고객이름, 날짜, 구매금액을 저장하고 있는 데이터프레임 생성
df5 = pd.DataFrame({'고객이름':['김파이썬', '박팬더스', '강주피터'], 
                    '날짜':['2020-01-01', '2020-02-01', '2020-02-15'],
                   '구매금액':[1,2,3]})
df5

   고객이름          날짜  구매금액
0  김파이썬  2020-01-01     1
1  박팬더스  2020-02-01     2
2  강주피터  2020-02-15     3

In [152]:
# 고객명, 성별을 지정하고 있는 데이터프레임을 생성
df6 = pd.DataFrame({'고객명':['김파이썬', '박팬더스'], '정보':['F', 'M']})
df6

    고객명 정보
0  김파이썬  F
1  박팬더스  M

In [154]:
# 겹치는 컬럼명이 없어서 에러 발생
pd.merge(df5, df6)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [155]:
# left(df5), right(df6)에서 공통컬럼명을 각각 지정
tmp = pd.merge(df5, df6, left_on='고객이름', right_on='고객명')
tmp

   고객이름          날짜  구매금액   고객명 정보
0  김파이썬  2020-01-01     1  김파이썬  F
1  박팬더스  2020-02-01     2  박팬더스  M

In [156]:
# drop 메서드를 이용해 '고객명' 컬럼을 삭제해주세요.
# tmp.drop('고객명', axis=1, inplace=True)
tmp.drop(columns='고객명', inplace=True)
tmp

   고객이름          날짜  구매금액 정보
0  김파이썬  2020-01-01     1  F
1  박팬더스  2020-02-01     2  M

#### concat

- 특정 key를 기준으로 데이터를 합치는 것이 아니라 행, 열 기준으로 데이터를 연결
- 주요 파라미터
    - axis : 0 / 행 방향(기본값)이며 컬럼을 key로 합치고, 1 / 열 방향으로 로우를 key로 합침
    - join : 데이터프레임끼리 연결할 때 합치는 방법으로 outer(기본값), inner 방식 존재
    - ignore_index : 합친 후 기존 인덱스를 유지 또는 새로운 인덱스를 지정

In [157]:
# 공통 인덱스 라벨을 가지는 Series 2개 생성
s1 = pd.Series([1, 2, 3], index=list('abc'))
s2 = pd.Series([5, 6, 7, 8], index=list('abfh'))
print(s1)
print(s2)

a    1
b    2
c    3
dtype: int64
a    5
b    6
f    7
h    8
dtype: int64

In [158]:
# 두 Series간 연결
# 기본 : axis=0(행 방향으로 연결)
# 첫번째로 전달된 객체가 위에, 두 번째로 전달된 객체가 아래로 추가(연결)
# 인덱스 라벨은 기존 값 유지
pd.concat([s1, s2])

a    1
b    2
c    3
a    5
b    6
f    7
h    8
dtype: int64

In [159]:
# 새로운 인덱스로 초기화하기
pd.concat([s1, s2], ignore_index=True)

0    1
1    2
2    3
3    5
4    6
5    7
6    8
dtype: int64

In [160]:
# 열 방향 연결 -> 두 개의 Series를 연결해서 하나의 DataFrame으로 만들기
# 길이가 다른경우
pd.concat([s1, s2], axis=1)

     0    1
a  1.0  5.0
b  2.0  6.0
c  3.0  NaN
f  NaN  7.0
h  NaN  8.0

In [161]:
# 열 이름을 설정하면서 붙여주기 : keys 파라미터에 컬럼명을 리스트로 전달
pd.concat([s1, s2], axis=1, keys=['c1', 'c2'])

    c1   c2
a  1.0  5.0
b  2.0  6.0
c  3.0  NaN
f  NaN  7.0
h  NaN  8.0

In [166]:
# 두 개의 데이터프레임 연결
# 고객명, 날짜, 금액
df1 = pd.DataFrame({'고객명':['김파이썬', '이장고', '박팬더스'],
                    '날짜':['2020-06-01', '2020-06-02', '2020-06-14'],
                   '구매금액':[1.0, 2.0, 3.0]})
# 고객명, 성별
df2 = pd.DataFrame({'고객명':['김파이썬', '최넘파이'],
                   '성별':['F', 'M']})

In [167]:
# 행 방향으로(row개수 증가) 데이터 프레임 연결
pd.concat([df1, df2])

    고객명          날짜  구매금액   성별
0  김파이썬  2020-06-01   1.0  NaN
1   이장고  2020-06-02   2.0  NaN
2  박팬더스  2020-06-14   3.0  NaN
0  김파이썬         NaN   NaN    F
1  최넘파이         NaN   NaN    M

In [169]:
# 열 방향으로 데이터프레임 연결
pd.concat([df1, df2], axis=1)

    고객명          날짜  구매금액   고객명   성별
0  김파이썬  2020-06-01   1.0  김파이썬    F
1   이장고  2020-06-02   2.0  최넘파이    M
2  박팬더스  2020-06-14   3.0   NaN  NaN

In [170]:
df3 = pd.DataFrame({'지역':['서울', '무산', '제주'],
                   '직업':['웹개발자', '회계사', '회사원']})
df3

   지역    직업
0  서울  웹개발자
1  무산   회계사
2  제주   회사원

In [171]:
# 전제조건 : df1과 df3의 데이터가 순서, 맥락상 맞는것이 확정적일때 concat으로 합치면 좋습니다.
pd.concat([df1, df3], axis=1)

    고객명          날짜  구매금액  지역    직업
0  김파이썬  2020-06-01   1.0  서울  웹개발자
1   이장고  2020-06-02   2.0  무산   회계사
2  박팬더스  2020-06-14   3.0  제주   회사원

### append
- 행 방향으로 데이터를 연결
- 주요 파라미터
    - ignore_index : 합친 후 기존 인덱스를 유지 또는 새로운 인덱스를 지정

In [172]:
# 두 개의 시리즈 생성
s1 = pd.Series([1, 2, 3])
s2 = pd.Series([4, 5, 6, 7])

In [173]:
# 행 방향으로 데이터 연결하고 기존 인덱스 유지
s1.append(s2)

0    1
1    2
2    3
0    4
1    5
2    6
3    7
dtype: int64

In [174]:
# 행 방향으로 데이터 연결하고 기존 인덱스 누락시키기
s1.append(s2, ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [176]:
# 두 개의 데이터프레임
# 서로 다른 컬럼명
df1 = pd.DataFrame([[1, 2], [3, 4]], columns=list('ab'))
df2 = pd.DataFrame([[5, 6], [7, 8], [9, 10]], columns=list('AB'))
print(df1)
print(df2)

   a  b
0  1  2
1  3  4
   A   B
0  5   6
1  7   8
2  9  10

In [177]:
df1.append(df2)

     a    b    A     B
0  1.0  2.0  NaN   NaN
1  3.0  4.0  NaN   NaN
0  NaN  NaN  5.0   6.0
1  NaN  NaN  7.0   8.0
2  NaN  NaN  9.0  10.0

In [178]:
# 두 개의 데이터프레임
# 동일한 컬럼명
df3 = pd.DataFrame([[10, 20],
                  [30, 40],
                  [50, 60]], columns=list('ab'))
df3

    a   b
0  10  20
1  30  40
2  50  60

In [179]:
# 동일한 컬럼명에 대해서 append를 하면 컬럼개수는 원본 데이터 숫자 그대로, 행만 추가
# append 는 보통 이런 케이스에 많이 사용함
df1.append(df3)

    a   b
0   1   2
1   3   4
0  10  20
1  30  40
2  50  60

In [180]:
# ignore_index를 걸면 인덱스번호도 0부터 다시 초기화
df1.append(df3, ignore_index=True)

    a   b
0   1   2
1   3   4
2  10  20
3  30  40
4  50  60

In [181]:
# 시리즈와 데이터프레임
# 데이터프레임에 한 줄 추가할때 보통 시리즈를 많이 사용함
# 시리즈 라벨 & 데이터프레임 컬럼명이 서로 일치할때 매칭됨
# 시리즈 라벨, 데이터프레임 컬럼명을 모두 a, b, c ,d로 매칭시킴
s1 = pd.Series([10, 20, 30, 40], index=list('abcd'))
df1 = pd.DataFrame([[1, 1, 1, 1],
                  [2, 2, 2, 2]], columns=list('abcd'))

In [182]:
s1

a    10
b    20
c    30
d    40
dtype: int64

In [183]:
df1

   a  b  c  d
0  1  1  1  1
1  2  2  2  2

In [185]:
# Series의 라벨이 df의 컬럼과 매칭이 됨
# 이 때 Series는 df의 새로운 row로 들어갑니다.
df1.append(s1, ignore_index=True)

    a   b   c   d
0   1   1   1   1
1   2   2   2   2
2  10  20  30  40

### 집계

- groupby(컬럼명)
    - 특정 속성을 기준으로 묶어서 다양한 집계 함수 적용
    - 대표적인 집계 함수
        - sum : 총합
        - mean : 평균값
        - min : 최소값
        - max : 최대값
        - count : 개수
        - std : 표준편차
- pivot table
    - df.pivot(로우로 사용될 컬럼명, 컬럼으로 사용될 컬럼명, 튜플을 구성하는 값으로 사용될 컬럼명, 집계함수)
    - 일차원으로 컬럼 및 로우가 단순 나열된 형식은 데이터를 파악하는데 적합하지 않기 때문에 pivot을 통해 계층 색인 및 형태 변경을 수행

In [186]:
# 엑셀 데이터 적재
# Os error -> engine='python'
# Unicode, Encoding -> encoding='utf-8' or 'cp949' or 'utf-16'
data = pd.read_excel('data/인구수예제.xlsx')
data

    도시   자치구    연도  남자인구  여자인구  총인구
0   서울   강남구  2013    73    92  165
1   서울   강남구  2014   139    55  194
2   서울   강남구  2015   123    83  206
3   서울   강남구  2016   147   150  297
4   서울   강남구  2017    57   133  190
5   서울  서대문구  2013    95   111  206
6   서울  서대문구  2014   149   150  299
7   서울  서대문구  2015   106    77  183
8   서울  서대문구  2016    56   109  165
9   서울  서대문구  2017    82    96  178
10  서울   종로구  2013   121    68  189
11  서울   종로구  2014   107    55  162
12  서울   종로구  2015    50    79  129
13  서울   종로구  2016   100    80  180
14  서울   종로구  2017   105    91  196
15  서울  영등포구  2013   146   113  259
16  서울  영등포구  2014   127   117  244
17  서울  영등포구  2015    70    72  142
18  서울  영등포구  2016   141   136  277
19  서울  영등포구  2017   145   124  269
20  서울   송파구  2013    90   130  220
21  서울   송파구  2014   121    66  187
22  서울   송파구  2015    62   121  183
23  서울   송파구  2016    80    92  172
24  서울   송파구  2017    62   150  212
25  서울   도봉구  2013   113   138  251
26  서울   도봉구  2014   145   140  285
27  서울   도봉구  2015    56   139  195
28  서울   도봉구  2016    60    71  131
29  서울   도봉구  2017   111    62  173
30  서울   동작구  2013   120   117  237
31  서울   동작구  2014    94   108  202
32  서울   동작구  2015    74   139  213
33  서울   동작구  2016    87    84  171
34  서울   동작구  2017    79   134  213
35  부산  해운대구  2013   124   103  227
36  부산  해운대구  2014   101   144  245
37  부산  해운대구  2015   115    70  185
38  부산  해운대구  2016   134   126  260
39  부산  해운대구  2017   146    72  218
40  부산   수영구  2013   134    94  228
41  부산   수영구  2014    74   138  212
42  부산   수영구  2015    69    81  150
43  부산   수영구  2016    81   148  229
44  부산   수영구  2017   144    98  242
45  부산   동래구  2013    83    65  148
46  부산   동래구  2014   139    87  226
47  부산   동래구  2015   147   115  262
48  부산   동래구  2016    61   102  163
49  부산   동래구  2017   132   105  237

In [187]:
# 데이터 구조 확인
data.shape

(50, 6)

In [188]:
# 상위 5개만 조회하기
data.head()

   도시  자치구    연도  남자인구  여자인구  총인구
0  서울  강남구  2013    73    92  165
1  서울  강남구  2014   139    55  194
2  서울  강남구  2015   123    83  206
3  서울  강남구  2016   147   150  297
4  서울  강남구  2017    57   133  190

In [189]:
# 하위 5개만 조회하기
data.tail()

    도시  자치구    연도  남자인구  여자인구  총인구
45  부산  동래구  2013    83    65  148
46  부산  동래구  2014   139    87  226
47  부산  동래구  2015   147   115  262
48  부산  동래구  2016    61   102  163
49  부산  동래구  2017   132   105  237

In [193]:
# 상위 10개 조회
data.head(10)

   도시   자치구    연도  남자인구  여자인구  총인구
0  서울   강남구  2013    73    92  165
1  서울   강남구  2014   139    55  194
2  서울   강남구  2015   123    83  206
3  서울   강남구  2016   147   150  297
4  서울   강남구  2017    57   133  190
5  서울  서대문구  2013    95   111  206
6  서울  서대문구  2014   149   150  299
7  서울  서대문구  2015   106    77  183
8  서울  서대문구  2016    56   109  165
9  서울  서대문구  2017    82    96  178

In [196]:
# 자치구별 남, 여 인구 각각의 총합
# 조사년도는 총 5개년
data.groupby('자치구')[['남자인구','여자인구']].sum()

      남자인구  여자인구
자치구
강남구    539   513
도봉구    485   550
동래구    562   474
동작구    454   582
서대문구   488   543
송파구    415   559
수영구    502   559
영등포구   629   562
종로구    483   373
해운대구   620   515

In [200]:
# 도시별 남, 여 인구의 총합을 구해주세요.
data.groupby('도시')[['남자인구','여자인구']].sum()

    남자인구  여자인구
도시
부산  1684  1548
서울  3493  3682

In [201]:
# 연도별, 도시별 과 같이 2개이상의 조건을 묶고싶을때는 .groupby([1번그룹, 2번그룹..])
# 형식으로 묶을수도 있습니다.
# 연도별, 도시별 남여인구 총합을 출력해주세요
data.groupby(['연도','도시'])[['남자인구','여자인구']].sum()

         남자인구  여자인구
연도   도시
2013 부산   341   262
     서울   758   769
2014 부산   314   369
     서울   882   691
2015 부산   331   266
     서울   541   710
2016 부산   276   376
     서울   671   722
2017 부산   422   275
     서울   641   790

In [204]:
# 도시별 연도별 총인구 평균을 구해주세요.
data.groupby(['연도', '도시'])['총인구'].mean()

연도    도시
2013  부산    201.000000
      서울    218.142857
2014  부산    227.666667
      서울    224.714286
2015  부산    199.000000
      서울    178.714286
2016  부산    217.333333
      서울    199.000000
2017  부산    232.333333
      서울    204.428571
Name: 총인구, dtype: float64

In [205]:
# 가독성을 높이기 위해 unstack() 사용
data.groupby(['연도', '도시'])['총인구'].mean().unstack()

도시            부산          서울
연도
2013  201.000000  218.142857
2014  227.666667  224.714286
2015  199.000000  178.714286
2016  217.333333  199.000000
2017  232.333333  204.428571

In [210]:
# 마지막으로 여러분들이 집계 아무거나 여태까지 안쓴것중 궁금한거 한 번 써서 구문을 저한테 보내주세요.
data.groupby(['도시'])['연도','총인구'].min()
data.groupby(['도시'])['연도','총인구'].max()

<ipython-input-210-0b3faa2db63b>:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data.groupby(['도시'])['연도','총인구'].min()
<ipython-input-210-0b3faa2db63b>:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data.groupby(['도시'])['연도','총인구'].max()

      연도  총인구
도시
부산  2017  262
서울  2017  299